emacs-central.org
*** Enhanced base functionality

#+BEGIN_SRC emacs-lisp :mkdirp :tangle base/08-lmx-base-tweaks.el
  ;;; 08-lmx-base-tweaks.el -*- lexical-binding: t; -*-

  ;; Define default Emacs environment settings
  (set-language-environment "utf-8")
  (set-default-coding-systems 'utf-8)

  (setq auto-save-list-file-prefix (concat user-emacs-directory ".local/auto-save/.saves-"))


  ;; Change Default yes-or-no-p to a shorter prompt
  (fset 'yes-or-no-p 'y-or-n-p)

  ;; Always reveal the pairing symbol (brackets mainly +/- others)
  (show-paren-mode t)

  ;; Enable entering brackets, quotes, double-quotes and other symbols in pairs
  (electric-pair-mode t)

  ;; Make the Editor aware of disk changes for any file opened within Emacs
  (global-auto-revert-mode 1)

  (use-package recentf
    :config
    (run-at-time nil (* 60 60) 'recentf-save-list)
    (setq recentf-save-file (concat user-emacs-directory ".local/recentf")
	  recentf-max-saved-items 1000
	  recentf-auto-cleanup 'never
	  recentf-exclude '("/ssh:"))
    )


  (use-package whitespace
    :diminish whitespace-mode
    :config
    (setq whitespace-line-column 10000))

  ;; Use `volatile-highlights' to highlight changes from pasting, ...etc.
  (use-package volatile-highlights
    :straight t
    :diminish volatile-highlights-mode
    :defer t
    :config
    (volatile-highlights-mode t))

  ;; rainbow-mode - colourise colours in the buffer
  (use-package rainbow-mode
    :straight t
    :defer t
    )

  ;; rainbow-delimiters - show matching brackets etc
  (use-package rainbow-delimiters
    :straight t
    :defer t
    :config
    (setq global-rainbow-delimiters-mode 1))

  ;; show page breaks
  (use-package page-break-lines
    :straight t
    :diminish page-break-lines-mode
    :defer t
    :config
    (global-page-break-lines-mode 1)
    (setq page-break-lines-modes '(emacs-lisp-mode lisp-mode scheme-mode compilation-mode outline-mode help-mode org-mode ess-mode latex-mode)))


  ;;; Makes Emacs Dashboard the Initial startup screen
  (use-package dashboard
    :straight t
    :init
    (setq dashboard-init-info
	       (if (and (boundp 'straight--profile-cache) (hash-table-p straight--profile-cache))
		   (format "%d packages loaded in %s" (hash-table-size straight--profile-cache) (emacs-init-time))))
    (dashboard-setup-startup-hook)
    :config
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
	  dashboard-set-heading-icons 1
	  dashboard-set-file-icons 1
	  dashboard-items '((recents . 5)
			    (projects . 5)
			    (bookmarks . 5))
	  dashboard-set-navigator 1
	  dashboard-center-content 1
	  dashboard-navigator-buttons `(;; line1
					((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
					  "Homepage"
					  "Browse homepage"
					  (lambda (&rest _) (browse-url "homepage")))
					 ("★" "Star" "Show stars" (lambda (&rest _) (show-stars)) warning)
					 ("?" "" "?/h" #'show-help nil "<" ">"))
					;; line 2
					((,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
					  "Linkedin"
					  ""
					  (lambda (&rest _) (browse-url "homepage")))
					 ("⚑" nil "Show flags" (lambda (&rest _) (message "flag")) error)))
	  dashboard-page-separator "\n \n"))

  ;; Garbagge collector Management
  (use-package gcmh
    :straight t
    :config
    (gcmh-mode t))


  ;; Enhanced keybinding user experience
  (use-package which-key
    :straight t
    :defer t
    :init
    (which-key-mode)
    :config
    (setq which-key-popup-type 'side-window
	  which-key-side-window-location 'bottom)
    )

#+END_SRC

*** Buffer Manager settings

#+BEGIN_SRC emacs-lisp :mkdirp yes :tangle base/09-bufmngr-conf.el
  ;;; 09-bufmngr-conf.el -*- lexical-binding: t; -*-

  (use-package ace-window
    :straight t
    :bind
    ("M-o" . ace-window))

  (use-package ibuffer
    :bind
    ("C-x C-b" . 'ibuffer))

#+END_SRC

*** Ligature Support
#+BEGIN_SRC emacs-lisp :mkdirp yes :tangle base/11-ligatures-conf.el
  ;; 11-ligatures-conf.el ;; -*- lexical-binding: t; -*- ;;

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Emacs version greater than 27.x running on GUI includes support for harfbuzz to properly   ;;
  ;; show ligatures and other utf-8 characters that can't 'directly' be shown on emacs versions ;;
  ;; earlier than 27.x.									      ;;
  ;; 											      ;;
  ;; Users on emacs greater than 27.x can without any workaround instructions show	      ;;
  ;; ligatures and emojis just by using a font that has these characters defined into it. In    ;;
  ;; order to get the same result on earlier emacs versions, some workaround instructions are   ;;
  ;; present on https://github.com/tonsky/FiraCode/wiki/Emacs-instructions and		      ;;
  ;; https://github.com/microsoft/cascadia-code/issues/153.				      ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


  ;; Workaround instructions for Emacs versions prior to 27.x
  (use-package fira-code-mode
    :defer t
    :straight t
    )

  ;; Enable ligature via the ligature.el melpa package
  (use-package ligature
    :defer t
    :straight (ligature :type git :host github :repo "mickeynp/ligature.el")
    :config
    (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
					 ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
					 "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
					 "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
					 "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
					 "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
					 "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
					 "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
					 "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
					 "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%")))

  (when (window-system)
    (add-hook 'prog-mode-hook
	      (if (featurep 'harfbuzz)
		  #'ligature-mode
		#'fira-code-mode)))
#+END_SRC

** Project Manager settings

#+BEGIN_SRC emacs-lisp :mkdirp yes :tangle base/10-prjmngr-conf.el 
  ;;; 10-prjmngr-conf.el -*- lexical-binding: t; -*-

  (use-package projectile
    :straight t
    :config
    (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
    (setq projectile-project-search-path '("~/Projects/"))
    (setq projectile-completion-system 'ivy)
    (setq projectile-mode-line-prefix " Project ")
    (projectile-mode +1))
#+END_SRC

* LMX Modules configuration
** File Manager settings

#+BEGIN_SRC emacs-lisp :mkdirp yes :tangle modules/file-manager/treemacs.el
  ;;; treemacs.el -*- lexical-binding: t; -*-

  (use-package treemacs
    :straight t
    :defer t
    :config
    (progn
      (setq treemacs-collapse-dirs (if treemacs-python-executable 3 0)
	    treemacs-deferred-git-apply-delay 0.5
	    treemacs-directory-name-transformer #'identity
	    treemacs-display-in-side-window t
	    treemacs-eldoc-display t
	    treemacs-file-event-delay 5000
	    treemacs-follow-after-init t
	    treemacs-git-command-pipe ""
	    treemacs-goto-tag-strategy 'refetch-index
	    treemacs-indentation 2
	    treemacs-indentation-string " "
	    treemacs-is-never-other-window nil
	    treemacs-max-git-entries 5000
	    treemacs-missing-project-action 'ask
	    treemacs-move-forward-on-expand nil
	    treemacs-no-png-images nil
	    treemacs-no-delete-other-windows t
	    treemacs-project-follow-cleanup nil
	    treemacs-persist-file (expand-file-name ".local/cache/treemacs-persist")
	    treemacs-position 'left
	    treemacs-recenter-distance 0.1
	    treemacs-recenter-after-file-follow nil
	    treemacs-recenter-after-tag-follow nil
	    treemacs-recenter-after-project-jump 'always
	    treemacs-recenter-after-project-expand 'on-distance
	    treemacs-show-hidden-files nil
	    treemacs-show-cursor nil
	    treemacs-silent-filewatch nil
	    treemacs-silent-refresh nil
	    treemacs-space-between-root-nodes t
	    treemacs-tag-follow-cleanup t
	    treemacs-tag-follow-delay 1.5
	    treemacs-user-mode-line-format nil
	    treemacs-user-header-line-format nil
	    treemacs-width 30
	    treemacs-workspace-switch-cleanup nil)
      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode t)
      (pcase (cons (not (null (executable-find "git")))
		   (not (null treemacs-python-executable)))
	(`(t . t)
	 (treemacs-git-mode 'deferred))
	(`(t . _)
	 (treemacs-git-mode 'simple))))
    :bind
    (:map global-map
	  ("C-<f3>" . treemacs)
	  ("M-0" . treemacs-select-window))
    )

  (use-package treemacs-projectile
    :after treemacs projectile
    :straight t)

  (use-package treemacs-magit
    :after treemacs magit
    :straight t)

  (use-package treemacs-persp
    :after treemacs perspective
    :straight t
    :config
    (treemacs-set-scope-type 'Perspectives))
#+END_SRC

** Auto Completion settings

#+BEGIN_SRC emacs-lisp :mkdirp yes :tangle modules/completion/complmngr-conf.el
  ;;; complmngr-conf.el -*- lexical-binding: t; -*-

  (use-package ivy
    :straight t
    :defer t
    :config
    (setq ivy-use-virtual-buffers t
	  ivy-count-format "[%d/%d] "
	  ivy-height 20)
    :init
    (ivy-mode 1)
    :bind
    (
     ("C-s" . 'swiper-isearch)
     ("C-r" . 'swiper-isearch-backward)
     ("M-x" . 'counsel-M-x)
     ("C-x C-f" . 'counsel-find-file)
     ("M-y" . 'counsel-yank-pop)
     ("<F1>-f" . 'counsel-describe-function)
     ("<F1>-v" . 'counsel-describe-variable)
     ("<F1>-l" . 'counsel-find-library)
     ("<F2>-i" . 'counsel-info-lookup-symbol)
     ("<F2>-u" . 'counsel-unicode-char)
     ("<F2>-j" . 'counsel-set-variable)
     ("C-x b" . 'ivy-switch-buffer)
     ("C-c v" . 'ivy-push-view)
     ("C-c V" . 'ivy-pop-view)
     ))

  (use-package ivy-posframe
    :straight t
    :after ivy
    :config
    (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-bottom-window-center)))
    (ivy-posframe-mode t))

  (use-package ivy-hydra)

  (use-package ivy-rich
    :straight t
    :defer t
    :after ivy counsel
    :init
    (ivy-rich-mode))

  (use-package all-the-icons-ivy-rich
    :straight t
    :defer t
    :after ivy ivy-rich counsel
    :init (all-the-icons-ivy-rich-mode)
    :config
    (setq all-the-icons-ivy-rich-icon-size 1.5))

  (use-package counsel
    :straight t
    :defer t)

  (use-package counsel-projectile
    :straight t
    :after projectile counsel)

  (use-package counsel-pydoc)


  ;; Use `company-mode' for in-buffer autocompletion. Company Mode has many backends.
  ;; These will be configured in here as well.

  (use-package company
    :straight t
    :config
    (add-hook 'after-init-hook 'global-company-mode)
    :init
    (setq company-idle-delay 0.1
	  company-minimum-prefix-length 2
	  company-tooltip-align-annotations t
	  company-global-modes '(not help-mode gud-mode message-mode erc-mode))

    :bind
    ("M-C-i" . 'company-complete))

  (use-package company-web
    :straight t
    )

  (use-package company-box
    :straight t
    :hook (company-mode . company-box-mode)
    :config
    (setq company-box-icons-alist 'company-box-icons-all-the-icons))

  (use-package company-jedi
    :straight t
    :after company elpy
    :config
    (add-to-list 'company-backends 'company-jedi))

#+END_SRC

** Checkers system

#+BEGIN_SRC emacs-lisp :mkdirp yes :tangle modules/checkers/checkers-conf.el
  ;;; checkers-conf -*- lexical-binding: t; -*-

  (use-package flycheck
    :straight t
    )


  (use-package flyspell
    :straight t
    )
    
#+END_SRC

** Programming
   
*** General Programming Support

 #+BEGIN_SRC emacs-lisp :mkdirp yes :tangle modules/prog/prog-conf.el
   ;;; prog-conf.el -*- lexical-binding: t; -*-

   ;; (dolist (attach '(my-set-fira-code-ligatures display-line-numbers-mode))
   ;;  (add-hook 'prog-mode-hook attach))

   (setq display-line-numbers-type 'relative)
   (add-hook 'prog-mode-hook
	     (if (fboundp 'display-line-numbers-mode)
		 #'display-line-numbers-mode
	     #'linum-mode))

 #+END_SRC

*** Snippets system

 #+BEGIN_SRC emacs-lisp :mkdirp yes :tangle modules/prog/snippets-conf.el
   ;;; snippets-conf.el -*- lexical-binding: t; -*-

   (use-package yasnippet
     :straight t
     :defer t
     :config
     (add-hook 'after-init-hook #'yas-reload-all)
     :init
     (yas-global-mode t)
     )

   (use-package yasnippet-snippets
     :straight t
     :after yasnippet)



 #+END_SRC

*** Programming language Support
**** Python support

  #+BEGIN_SRC emacs-lisp :mkdirp yes :tangle modules/lang/python-conf.el
    ;;; python-conf -*- lexical-binding: t; -*-

    (use-package elpy
      :straight t
      :defer t
      :init
      (advice-add 'python-mode :before #'elpy-enable)
      :config
      (when (require 'flycheck nil t)
	(setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
	))

    (use-package pyvenv
      :straight t
      :defer t
      :config
      (advice-add 'python-mode :before #'pyvenv-mode))

    (use-package py-autopep8
      :config
      (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save))

    (use-package ein
      :config
      (setq python-shell-interpreter "ipython"
	    python-shell-interpreter-arg "-i --simple-prompt"))
  #+END_SRC

